package home.work.level03;

/*
 *  Бал: 
 *  Исполнитель: ruslan_lizogub
 *  Код решения: 
 *  Задание: 
 *  Пользователь вводит имя текстового файла (text.txt), заменить все "нецензурные слова" в файле на [вырезано цензурой],
 	результат записать в тот же файл. "нецензурные слова" находятся в файле obscene.txt, каждое в отдельной строке.
 	Пример:
 	obscene.txt {паршивец, хам, тряпка, смерд, симулянт, собака, сорванец, тупой как пробка, рохля, козёл, негодяй}
 	text.txt {Расскажу вам как козёл, хам и симулянт удивлялись что собака выиграла грант}
 	text.txt {Расскажу вам как [вырезано цензурой], [вырезано цензурой] и [вырезано цензурой] удивлялись
 	 что [вырезано цензурой] выиграла грант}
 */

public class Ex03Censorship {

}
